# Код Морзе для представления цифр и букв использует тире и точки. Напишите
# функцию для кодирования текстового сообщения в соответствии с кодом Морзе.
# (словари в помощь)

def cod_to_morze(input_string):
    dictionary = {"A": ".-", "B": "-...", "C": "-.-.", "D": "-..", "E": ".", "G": "--.",
                  "H": "....", "I": "..", "J": ".---", "K": "-.-", "L": ".-..", "M": "--",
                  "N": "-.", "O": "---", "P": ".--.", "Q": "--.-", "R": ".-.", "S": "...",
                  "T": "-", "U": "..-", "V": "...-", "W": ".--", "X": "-..-", "Y": "-.--",
                  "Z": "--..", "0": "-----", "1": ".----", "2": "..---", "3": "...--",
                  "4": "....-", "5": ".....", "6": "-....", "7": "--...", "8": "---..",
                  "9": "----.", " ": " "}
    input_string = input_string.upper()
    output_string = ""
    for letter in input_string:
        output_string += dictionary[letter] + " "
    return output_string


user_input = input("Введите текст для кодирования c помощью кода Морзе: ")

print("Кодированный текст: ", cod_to_morze(user_input))
